const state = {
  // 民族列表
  nations: [
    '汉族',
    '蒙古族',
    '回族',
    '藏族',
    '维吾尔族',
    '苗族',
    '彝族',
    '壮族',
    '布依族',
    '朝鲜族',
    '满族',
    '侗族',
    '瑶族',
    '白族',
    '土家族',
    '哈尼族',
    '哈萨克族',
    '傣族',
    '黎族',
    '僳僳族',
    '佤族',
    '畲族',
    '高山族',
    '拉祜族',
    '水族',
    '东乡族',
    '纳西族',
    '景颇族',
    '柯尔克孜族',
    '土族',
    '达斡尔族',
    '仫佬族',
    '羌族',
    '布朗族',
    '撒拉族',
    '毛南族',
    '仡佬族',
    '锡伯族',
    '阿昌族',
    '普米族',
    '塔吉克族',
    '怒族',
    '乌孜别克族',
    '俄罗斯族',
    '鄂温克族',
    '德昂族',
    '保安族',
    '裕固族',
    '京族',
    '塔塔尔族',
    '独龙族',
    '鄂伦春族',
    '赫哲族',
    '门巴族',
    '珞巴族',
    '基诺族'
  ],
  // 教育背景
  eduBackgrounds: ['大专', '本科', '硕士', '博士', '高中', '初中'],
  // 项目列表
  applyProjectNames: [
    '游泳',
    '花样游泳',
    '跳⽔',
    '⽔球',
    '铁⼈三项',
    '公开⽔域'
  ],
  // 裁判等级
  refereeLevels: ['国际级', '国家级', '⼀级', '⼆级', '三级', '⽆等级'],
  coachLevel: ['国家级', '高级', '中级', '初级'],
  // 裁判岗位
  refereeJobs: [
    '执⾏总裁',
    '⾃动计时',
    '技术检查',
    '终点/转身端检查',
    '发令',
    '宣告',
    '编排',
    '检录',
    '计时'
  ],
  // 教练等级
  coachLevels: ['国家级', '⾼级', '中级', '初级'],
  // 运动员国家级别
  athleteNationalLevels: [
    '⽆等级',
    '国家三级运动员',
    '⼆级',
    '⼀级',
    '运动健将',
    '国际健将'
  ],
  // 运动员省内等级
  athleteProvinceLevels: ['AAAA', 'AAA', 'AA', 'A', 'BB', 'B'],
  // 人际关系列表
  peopleRelations: ['⽗亲', '⺟亲', '亲属', '朋友', '其他'],
  // 场馆类型
  venusTypes: ['室内', '室外'],
  // 场馆大小列表
  venueSizes: [
    '⻓50⽶，8条泳道及以上',
    '⻓25⽶，6条泳道及以上',
    '⻓25⽶，5条泳道及以下'
  ],
  // 社会指导员职业资格等级
  guidanceLevel: [
    '一级',
    '二级',
    '三级',
    '四级',
    '五级'
  ],
  // 救生员注册等级
  registerCertLevel: [
    '三级',
    '四级',
    '五级'
  ]
}

export default {
  namespaced: true,
  state
}
